-- Сервис Tsmodem служит основным "сервером" для работы с GSM-модемом по АТ-протоколу
---==================================================================================
-- Сервис подключается к GSM-модему на логическом порту /dev/ttyUSBx,
-- прослушиват ответы от АТ-команд, а также периодически отправляет в модем АТ-команды
-- для получения характеристик о состоянии сотовой сети, таких как:
-- - уровень сигнала до базовой станции;
-- - определение оператора сотовой связи;
-- - режим связи (2G/3G/LTE/4G и т.п.)
-- - наличие / отсутствие регистрации Сим-карты в сотовой сети.

-- Состав основных модулей:
---=======================
-- в папке /driver расположены слдующие основные модули сервиса:
-- - modem.lua    - основной инициатор;
-- - state.lua    - модуль хранения состояний;
-- - timer.lua    - модуль отсчёта интервалов между отправкой АТ-команд;
-- - notifier.lua - модуль поднятия событий на шине UBUS;
-- - lock.lua     - реализует режимы "занят / свободен"
-- - util.lua     - модуль вспомогательных функций

-- Модули, реализующие разбор ответов АТ-команд согласно A76XXSeries_AT CommandManual V1.06 2021.11.9
---==================================================================================================
-- /spec/v300_ch3.lua - Chapter 3. AT Commands According to V.25TER
-- /spec/v300_ch4.lua - Chapter 4. AT Commands for Network
-- /spec/v300_ch9.lua - Chapter 9. AT Commands for SMS

-- Парсеры
---=======
-- каталог /parser содержит расширямый набор парсеров, позволяющих выбрать из АТ-ответов необходимые данные.
-- Несколько примеров:
-- - creg.lua           - AT+CREG: выбирает из АТ-ответа целое число, показывающее статус регистрации Сим-карты в сети;
-- - csq.lua            - AT+CSQ: выбирает из АТ-ответа целое число, показывающее уровень сигнала от базовой станции;
-- - provider_name.lua  - +NITZ: PLMN Long Name: выбирает тестовое имя оператора сотовой сети.

-- Взаимодействие с другими сервисами
---==================================
-- Сервис Tsmodem является главным поставщиком данных о состоянии сотовой сети,
-- а также основным механизом для передачи АТ-команд GSM-модему от других сервисов.
-- Данные о состоянии сотовой сети, а также методы передачи АТ-команд предоставляются на шине UBUS.

-- Сервис Applogic (application logic rules) периодически опрашивает Tsmodem по шине UBUS,
-- получая тем самым данные для принятия решений.

-- Сервис Tsmsms пользуется сервисом Tsmodem для отправки/приёма Смс-сообщений;

-- Сервис Tsmslot, перед переключением слотов Сим-карт, обращается к Tsmodem 
-- для отключения GSM-модема от порта /dev/ttyUSBx.

-- Режитм отладки
---==============
-- tsmodem debug all
-- (в shell-консоли прибора)



local timer = require "tsmodem.driver.timer"
local state = require "tsmodem.driver.state"
local modem = require "tsmodem.driver.modem"
local notifier = require "tsmodem.driver.notifier"

local signal = require("posix.signal")
signal.signal(signal.SIGINT, function(signum)

  io.write("\n")
  print("-----------------------")
  print("Tsmodem debug stopped.")
  print("-----------------------")
  io.write("\n")
  os.exit(128 + signum)
end)


modem(state, timer, notifier)
